Revit 2027 API
BuiltInFailures.DimensionFailures.DimensionReferencesInvalid Property
 One or more dimension references are or have become invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DimensionReferencesInvalid { get; }
Public Shared ReadOnly Property DimensionReferencesInvalid As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DimensionReferencesInvalid {
	FailureDefinitionId^ get ();
}
static member DimensionReferencesInvalid : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace